Documents/DMS_СогласиеНаОбработкуПерсональныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_СогласиеНаОбработкуПерсональныхДанных</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.CRM_ПотенциальныеКонтрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СканКопия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтветов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаКоммуникацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаПодключаемыеСервисы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_СогласиеНаОбработкуПерсональныхДанных/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Если СканКопия.Получить() = Неопределено Тогда
	//	Отказ=Истина;
	//	Сообщить("Не приложен скан соглашения",СтатусСообщения.Внимание);
	//	Возврат
	//КонецЕсли;
	
	//Спр=ФизическоеЛицо.ПолучитьОбъект();
	//Спр.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да;
	//Спр.СогласиеНаОбработкуПерсональныхДанныхДата=Дата;
	//Спр.Записать();
	
	СсылкаДубль = Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ВернутьСогласиеПоКлиенту(ФизическоеЛицо);
	
	Если ЗначениеЗаполнено(СсылкаДубль) и СсылкаДубль<>Ссылка Тогда  
		Сообщить("У клиента уже существует проведенный документ обработки персональных данных "+СсылкаДубль);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ЗаписатьКлиента = Ложь;
	
	КлиентОбъект = ФизическоеЛицо.ПолучитьОбъект();
	
	Если СогласиеНаОбработкуПерсональныхДанных <> ФизическоеЛицо.СогласиеНаОбработкуПерсональныхДанных Тогда
		КлиентОбъект.СогласиеНаОбработкуПерсональныхДанных = СогласиеНаОбработкуПерсональныхДанных;
		КлиентОбъект.СогласиеНаОбработкуПерсональныхДанныхДата = ТекущаяДатаСеанса();
		ЗаписатьКлиента = Истина;
	КонецЕсли;

	Если ТипЗнч(ФизическоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Если СогласиеНаКоммуникацию <> КлиентОбъект.СогласиеНаПолучениеSMS  Тогда
			КлиентОбъект.СогласиеНаПолучениеSMS = СогласиеНаКоммуникацию;
			//КлиентОбъект.СогласиеНаПолучениеSMSДата = ТекущаяДатаСеанса();
			DMS_ФизическиеЛицаСервер.ЗаписатьСогласиеНаОПД(КлиентОбъект);
			ЗаписатьКлиента = Истина;
		КонецЕсли;
	Иначе 
		Если СогласиеНаКоммуникацию <> КлиентОбъект.СогласенНаКоммуникацию  Тогда
			КлиентОбъект.СогласенНаКоммуникацию = СогласиеНаКоммуникацию;
			ЗаписатьКлиента = Истина;
		КонецЕсли;
	КонецЕсли;

	КлиентОбъект.Записать();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Спр=ФизическоеЛицо.ПолучитьОбъект();
	Спр.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Спрашивать;
	Спр.СогласиеНаОбработкуПерсональныхДанныхДата="";
	Спр.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ФизическоеЛицо=ДанныеЗаполнения;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

КонецПроцедуры
